app/views/jobs/_form.html.haml

SELECT "categories".* FROM "categories"
---
= simple_form_for(@job, html: { class: 'form-horizontal'}) do |f|
	= f.collection_select :category_id, Category.all, :id, :name, { prompt: "Choose a category"}, input_html: {class: "dropdown-toggle"}